# NaN - means Not a Number

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
n = np.nan

In [3]:
type(n)

float

In [4]:
m = 1
m + n

nan

# Nan in Series

In [5]:
s1 = Series([1, 2, np.nan, 3, 4], index=['A','B','C','D','E'])

In [6]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [7]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [8]:
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [9]:
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

# NaN in DataFrame

In [10]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [11]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [12]:
dframe.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [13]:
dframe.notnull()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [14]:
# axis=0 行
# axis=1 列
# all
df1 = dframe.dropna(axis=0,how='all')

In [15]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [16]:
dframe.dropna(thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [17]:
dframe.fillna(value={0:0,1:1,2:2,3:3})

     0    1    2
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  7.0  1.0  9.0
3  0.0  1.0  2.0

In [18]:
df1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [19]:
# axis=0按行添加，列的和
# axis=1按列，每行的和
dframe.sum(axis=0)

0     8.0
1     7.0
2    18.0
dtype: float64

In [20]:
dframe.sum(axis=1)

0     6.0
1    11.0
2    16.0
3     0.0
dtype: float64